balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F3014.PIC
      <edc:DCRDef edc:access="nn---nnn---nnnnn" edc:cname="FUID3" edc:default="0xf9e0" edc:desc="" edc:impl="0xc71f" edc:name="FUID3" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xc71f">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:UserIDSector>
    <edc:ConfigFuseSector edc:beginaddr="0xf80000" edc:endaddr="0xf8000e" edc:regionid="cfgmem">
      <edc:DCRDef edc:access="nn---nnn---nnnnn" edc:cname="FOSC" edc:default="0xf9e0" edc:desc="" edc:impl="0xc71f" edc:name="FOSC" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xc71f">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FOSFPR" edc:desc="Oscillator" edc:mask="0x71f" edc:name="FOSFPR" edc:nzwidth="0xb">
              <edc:DCRFieldSemantic edc:cname="ECIO_PLL4" edc:desc="ECIO w/PLL 4x" edc:when="(field &amp; 0x71f) == 0x70d">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="ECIO_PLL4"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ECIO_PLL8" edc:desc="ECIO w/PLL 8x" edc:when="(field &amp; 0x71f) == 0x70e">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="ECIO_PLL8"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ECIO_PLL16" edc:desc="ECIO w/PLL 16x" edc:when="(field &amp; 0x71f) == 0x70f">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="ECIO_PLL16"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="FRC_PLL4" edc:desc="FRC w/PLL 4x" edc:when="(field &amp; 0x71f) == 0x701">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="FRC_PLL4"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="FRC_PLL8" edc:desc="FRC w/PLL 8x" edc:when="(field &amp; 0x71f) == 0x70a">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="FRC_PLL8"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="FRC_PLL16" edc:desc="FRC w/PLL 16x" edc:when="(field &amp; 0x71f) == 0x703">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="FRC_PLL16"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="XT_PLL4" edc:desc="XT w/PLL 4x" edc:when="(field &amp; 0x71f) == 0x705">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="XT_PLL4"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="XT_PLL8" edc:desc="XT w/PLL 8x" edc:when="(field &amp; 0x71f) == 0x706">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="XT_PLL8"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="XT_PLL16" edc:desc="XT w/PLL 16x" edc:when="(field &amp; 0x71f) == 0x707">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="XT_PLL16"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HS2_PLL4" edc:desc="HS2 w/PLL 4x" edc:when="(field &amp; 0x71f) == 0x711">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="HS2_PLL4"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HS2_PLL8" edc:desc="HS2 w/PLL 8x" edc:when="(field &amp; 0x71f) == 0x712">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="HS2_PLL8"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HS2_PLL16" edc:desc="HS2 w/PLL 16x" edc:when="(field &amp; 0x71f) == 0x713">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="HS2_PLL16"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HS3_PLL4" edc:desc="HS3 w/PLL 4x" edc:when="(field &amp; 0x71f) == 0x715">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="HS3_PLL4"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HS3_PLL8" edc:desc="HS3 w/PLL 8x" edc:when="(field &amp; 0x71f) == 0x716">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="HS3_PLL8"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HS3_PLL16" edc:desc="HS3 w/PLL 16x" edc:when="(field &amp; 0x71f) == 0x717">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="HS3_PLL16"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ECIO" edc:desc="ECIO" edc:when="(field &amp; 0x71f) == 0x30c">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="ECIO"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="XT" edc:desc="XT" edc:when="(field &amp; 0x71f) == 0x304">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="XT"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS" edc:when="(field &amp; 0x71f) == 0x302">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="HS"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="EC" edc:desc="EC" edc:when="(field &amp; 0x71f) == 0x30b">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="EC"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ERC" edc:desc="ERC" edc:when="(field &amp; 0x71f) == 0x309">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="ERC"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ERCIO" edc:desc="ERCIO" edc:when="(field &amp; 0x71f) == 0x308">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="ERCIO"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="XTL" edc:desc="XTL" edc:when="(field &amp; 0x71f) == 0x300">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="XTL"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="LP" edc:desc="Low-Power 32KHz Osc (No change to Primary Osc Mode bits)" edc:when="(field &amp; 0x700) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="LP"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="FRC" edc:desc="Internal Fast RC (No change to Primary Osc Mode bits)" edc:when="(field &amp; 0x700) == 0x100">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="FRC"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="Internal Low-Power RC (No change to Primary Osc Mode bits)" edc:when="(field &amp; 0x700) == 0x200">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="LPRC"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:DCRFieldDef edc:cname="FCKSMEN" edc:desc="Clock Switching and Monitor" edc:mask="0x3" edc:name="FCKSMEN" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="CSW_FSCM_OFF" edc:desc="Sw Disabled, Mon Disabled" edc:when="(field &amp; 0x2) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="CSW_FSCM_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="CSW_ON_FSCM_OFF" edc:desc="Sw Enabled, Mon Disabled" edc:when="(field &amp; 0x3) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="CSW_ON_FSCM_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="CSW_FSCM_ON" edc:desc="Sw Enabled, Mon Enabled" edc:when="(field &amp; 0x3) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="CSW_FSCM_ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="n---------nnnnnn" edc:cname="FWDT" edc:default="0xffff" edc:desc="" edc:impl="0x803f" edc:name="FWDT" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x803f">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FWPSB" edc:desc="WDT Prescaler B" edc:mask="0xf" edc:name="FWPSB" edc:nzwidth="0x4">
              <edc:DCRFieldSemantic edc:cname="WDTPSB_1" edc:desc="1:1" edc:when="(field &amp; 0xf) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_1"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_2" edc:desc="1:2" edc:when="(field &amp; 0xf) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_2"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_3" edc:desc="1:3" edc:when="(field &amp; 0xf) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_3"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_4" edc:desc="1:4" edc:when="(field &amp; 0xf) == 0x3">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_4"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_5" edc:desc="1:5" edc:when="(field &amp; 0xf) == 0x4">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_5"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_6" edc:desc="1:6" edc:when="(field &amp; 0xf) == 0x5">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_6"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_7" edc:desc="1:7" edc:when="(field &amp; 0xf) == 0x6">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_7"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_8" edc:desc="1:8" edc:when="(field &amp; 0xf) == 0x7">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_8"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_9" edc:desc="1:9" edc:when="(field &amp; 0xf) == 0x8">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_9"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_10" edc:desc="1:10" edc:when="(field &amp; 0xf) == 0x9">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_10"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_11" edc:desc="1:11" edc:when="(field &amp; 0xf) == 0xa">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_11"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_12" edc:desc="1:12" edc:when="(field &amp; 0xf) == 0xb">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_12"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_13" edc:desc="1:13" edc:when="(field &amp; 0xf) == 0xc">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_13"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_14" edc:desc="1:14" edc:when="(field &amp; 0xf) == 0xd">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_14"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_15" edc:desc="1:15" edc:when="(field &amp; 0xf) == 0xe">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_15"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSB_16" edc:desc="1:16" edc:when="(field &amp; 0xf) == 0xf">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSB_16"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FWPSA" edc:desc="WDT Prescaler A" edc:mask="0x3" edc:name="FWPSA" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="WDTPSA_1" edc:desc="1:1" edc:when="(field &amp; 0x3) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSA_1"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSA_8" edc:desc="1:8" edc:when="(field &amp; 0x3) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSA_8"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSA_64" edc:desc="1:64" edc:when="(field &amp; 0x3) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSA_64"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPSA_512" edc:desc="1:512" edc:when="(field &amp; 0x3) == 0x3">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPSA_512"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="9"/>
            <edc:DCRFieldDef edc:cname="WDT" edc:desc="Watchdog Timer" edc:mask="0x1" edc:name="WDT" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="WDT_ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDT_ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDT_OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDT_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="n----nnnn-nn--nn" edc:cname="FBORPOR" edc:default="0xffff" edc:desc="" edc:impl="0x87b3" edc:name="FBORPOR" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x87b3">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FPWRT" edc:desc="POR Timer Value" edc:mask="0x3" edc:name="FPWRT" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="PWRT_OFF" edc:desc="Timer Disabled" edc:when="(field &amp; 0x3) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="PWRT_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="PWRT_4" edc:desc="4ms" edc:when="(field &amp; 0x3) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="PWRT_4"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="PWRT_16" edc:desc="16ms" edc:when="(field &amp; 0x3) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="PWRT_16"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="PWRT_64" edc:desc="64ms" edc:when="(field &amp; 0x3) == 0x3">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="PWRT_64"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="BODENV" edc:desc="Brown Out Voltage" edc:mask="0x3" edc:name="BODENV" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="BORV45" edc:desc="4.5V" edc:when="(field &amp; 0x3) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="BORV45"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="BORV42" edc:desc="4.2V" edc:when="(field &amp; 0x3) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="BORV42"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="BORV27" edc:desc="2.7V" edc:when="(field &amp; 0x3) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="BORV27"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="BORV20" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="BORV20"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="BOREN" edc:desc="PBOR Enable" edc:mask="0x1" edc:name="BOREN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="PBOR_ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="PBOR_ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="PBOR_OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="PBOR_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RES0" edc:desc="Reserved" edc:ishidden="true" edc:mask="0x7" edc:name="RES0" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:DCRFieldDef edc:cname="MCLRE" edc:desc="Master Clear Enable" edc:mask="0x1" edc:name="MCLRE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="MCLR_EN" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="MCLR_EN"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="MCLR_DIS" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="MCLR_DIS"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
